{"index":{"title":"Hi, I'm Paul Jacobson an Engineer","links":["AboutMe/About-Me","AboutMe/Resumes","Projects/Portfolio"],"tags":[],"content":"Hello §\nIf you are reading this you probably have scanned my business card. Here are some useful links.\nAbout Me §\nLinkedIn §\nResume §\nGithub §\nPortfolio §\nContact Me §\nThanks §\nThanks for checking out my site! I hope to hear from you soon."},"AboutMe/About-Me":{"title":"About Me","links":["Projects/FPV-Drones/FPV-Drones","Projects/Additive-Manufacturing/Additive-Manufacturing"],"tags":[],"content":"Hello! I’m a resourceful engineer with a solid foundation in both mechanical and computer engineering, shaped by my Engineering Physics major and Computer Science minor. My experience spans building and using 3D printers, developing real-time embedded systems, and creating complex projects like walking machines and coil guns. Additionally, I have a year of hands-on experience at MTI Motion focused on designing and creating electric motors for several applications including the aerospace and defense, down-hole, and other industrial motors.\nBut I’m not just a techie; I love learning and sharing knowledge. As the former President of the Pioneer Drone Club at UW-Platteville, I was responsible for club operations, maintaining an extensive set of drone equipment, and organizing educational tutorials on FPV Drones piloting.\nWhether it’s designing parts for manufacture on a state-of-the-art 3D-Printer, coding an efficient algorithm, or leading a motivated team, I’m always up for a new challenge!"},"AboutMe/Resumes":{"title":"Resumes","links":[],"tags":["resume"],"content":"Resume §\n\n                      \n                    \nLetter of Recommendation §\n\n                      \n                    "},"Projects/Portfolio":{"title":"Portfolio","links":["Projects/Additive-Manufacturing/Additive-Manufacturing","Projects/FPV-Drones/FPV-Drones","Projects/NozeWipe/NozeWipe","Projects/ScribbleStarter/Scribble~Starter"],"tags":["project"],"content":"Additive Manufacturing §\nFPV Drones §\nNozeWipe §\n     3D printer nozzle wiper for Voron printers.  \nScribble~Starter §\n     Senor design project a per-writing skill tool.  "},"Projects/Additive-Manufacturing/Additive-Manufacturing":{"title":"Additive Manufacturing","links":["Projects/NozeWipe/NozeWipe"],"tags":[],"content":"\nAdditive Manufacturing §\nI’ve spent the past 8 years working with 3D printing, starting with a Sidewinder X1 and eventually moving on and building a Voron 2.4, which I’ve added seveal mods, including a nozzle wipe I designed myself. This progression has honed my skills in design-for-manufacturing and given me practical, in-depth experience in additive manufacturing. Each project has deepened my understanding of 3D printing mechanics, materials, and optimization techniques essential for precise and reliable output."},"Projects/FPV-Drones/FPV-Drones":{"title":"FPV Drones","links":[],"tags":[],"content":"\nAn Quick Explanation of FPV Drones. §\nAn FPV (First Person View) drone consists of several key components including the carbon fiber frame provides the structure. Motors and propellers generate thrust and are driven by the electronic speed controllers (ESCs) to regulate motor speed. The flight controller is the drone’s “brain,” processing inputs from the transmitter and sensors to control flight. A lipo battery, not show in the photo, and powers the entire drone. The FPV camera captures a live video feed, transmitting it through a video transmitter (VTX) to FPV goggles or a screen, enabling the pilot to see from the drone’s perspective. The radio receiver communicates with the pilot’s transmitter, allowing remote control of the drone.\nExperience §\nOver the past six years, I’ve immersed myself in every aspect of FPV drones researching, building, troubleshooting, and inevitably crashing, only to repair and improve them. Each step, from selecting parts to troubleshooting hardware and software, has been a hands-on lesson. Leading the Pioneer Drone Club as its president gave me the chance to share this passion, foster teamwork, and guide others in exploring FPV technology. These experiences have shaped both my technical expertise and leadership skills, providing a foundation that continues to drive my enthusiasm for drone innovation."},"Projects/ScribbleStarter/Scribble~Starter":{"title":"Scribble~Starter","links":[],"tags":["project"],"content":"About §\nThe Scribble~Starter is a pen that lights up and plays sound when writing or drawing on a planner surface. The motivation is to make a tool for promoting writing skills in young kids with or without developmental delays. The work on this project was done in collaboration with Lindsey Rowley at UnityPoint Health.\n\nWork done §\nSydney Bruce, Madalyn Kaweski, Cameron Uselding, and I completed this project as part of Engineering Physics Senior Design. Lindsey and Dr. Evensen provided several topics and project ideas for our project. We took the suggested topics and created the Scribble~Starter project. We defined the project definition and constraints, proposed and reviewed alternate designs, and completed a risk analysis. We also completed project planning steps, such as project decomposition, and planned with a Gantt Chart. We also started the process of patenting this project through WiSys. Finally, we finished designing it and testing the prototype.\nI initially helped with the machine learning model and some embedded system knowledge. Next, I helped with comparing alternative designs and project risk analysis. I mostly did the fabrication using my skills with 3D printing and soldering. I also completed the final CAD model; doing so was vital because I shrunk the prototype to a reasonable size. Most importantly, it allowed for testing with an actual wring utensil.\nFuture Improvements §\nEven though we achieved most of the project’s goals, several things can be improved. First is the clamping mechanism used to hold a writing utensil. The design used in the final prototype used three TPU parts that would clamp when compressed. The TPU sections did clamp the writing utensil; however, the mechanism to compress the TPU needs work. Another potential fix is not to compress the TPU; instead, make a long and more flexible arch. Doing so would remove moving parts and simplify assembly.\nWe did not make this change because we ran out of time. The project needed to be completed in a semester. Luckily, there are plans to finish more work on this project as another senior design project.\nHere are some pictures of the project at various stages §\n\n\n\n"},"Projects/NozeWipe/NozeWipe":{"title":"NozeWipe","links":[],"tags":["project"],"content":"\nAbout §\nA Voron 3D printer mod for cleaning the nozzle of the printer. It was designed to be simple and adjustable, providing a suitable nozzle cleaner. It used silicone wipes and a block for the Blackbox 3D Printer.\nYou can learn more by looking at it on my Github project.\nV2 Coming soon §\nI have been using a version 2 for several months without issue. The wipe and block now travel with the gantry behind the bed. This allows for the hot end to be parked on the block after the print is done. This uses lots of the same scripts allowing for easy upgrade. The expected release date is around Jan 2025.\nMotivation §\nI built my Voron with the Voron-Tap, Nevermore, and the Kinematic Bed mods, instead of upgrading it over time. I noticed that z homing of the printer could be affected by any filament on the printer’s nozzle. I decided to make my own Voron mod using existing silicon wipes for a different printer to solve this.\nChallenges §\nRequirements §\nThere were several design challenges and criteria that had to be met. First, the design must be printable. It’s for a 3D-Printer so this is obvious. This means all parts must have a flat surface to print on and minimal overhangs.\nThe following requirement is cleaning the nozzle. The silicone wipes allow wiping the nozzle off while hot, and the block provides a place to heat up while stopping oozing. I chose the silicon parts because they already exist and have been proven to work. I decided not to use a silicone brush  because it would require finding that exact brush and did not allow for purging in a location that allowed for the removal of extruded filament. Finally, I chose not to use a brass brush because it could ablate the nozzles even with similar metals.\nIt must also be strong enough to be used repetitively and reliably. The NozeWipe does not experience much force, but because of the Nevermore and adjust requirement, the mount is a lever arm and can cause the mount to bend.\nThe NozeWipe is adjustable in two dimensions, z and y. It must be adjustable because I did not have a complete cad assembly for the Voron 2.4 that has a Kinematic Bed modeled. It also allows for more flexibility in using different beds and surfaces.\n\n\nThe image above was the first iteration. I used a large mount arm and holder that would screw together. It did not allow for vertical adjustment. The section where the mount arm thinned near the top was to allow for clearance around the Kinematic Bed. The thin section allowed for excess flexibility when in use.\n\nThe next iteration was to remove the flex in the arm. However, This decreases flexibility but adds complexity. It still has the screw-together mount. This was the cause of the next iteration. I could not effectively arrange the wipers and silicone blocks with heat-set inserts. The other deficit of this design is its complexity. It took more work to assemble and was overkill to hold the parts together.\n\nThe second to last iteration improved the holder and mounting arm. The holder was simplified to allow friction fix of the wipers and to hot glue the silicone block into place. However, the holder had a fatal flaw. The wall of the outer wipe was too thin and broke during installation and use. The arm was significantly improved with features to increase stiffness in the arm but allow clearance for the Kinematic Bed. The bin in this design was never used.\n\nHere is the final design. The wall of the holder was thickened, and the main changes to the design were to the bin. The bin is now shorter and magnetically attached to the holder with ribbing to increase durability. However, the wall closest to the bed is still thin and brittle.\nConclusion §\nThe NozeWipe is one of the most polished projects I have completed. It’s printable, adjustable, functional, and reliable. I can start a print and not worry about it starting and getting a perfect first layer. Furthermore, it looks like it belongs in my Voron; it is functionally beautiful.\nIn the future, I would like to see if the wipe makes the Tap more reliable. I have not tested this because some other things add uncertainty to the measurements. I will have to track those problems down before testing for any improvements."}}